backend/views/feature-seller/_form.php

SELECT * FROM `taz_user` WHERE (`status`='Active') AND (`user_type`='Seller')
---
/* @var $this yii\web\View */
/* @var $model frontend\models\FeatureSeller */
/* @var $form yii\widgets\ActiveForm */
$users = User::find()->where(['status' => 'Active', 'user_type'=>'Seller'])->all();