frontend/views/order/index.php

SELECT COUNT(*) FROM `taz_order` WHERE (`user_id`=3) AND (order_status<>"USER CANCELLED") AND (order_status<>"FAILED-TRANSACTION") AND (order_status<>"CANCELLED")
---
                    <?= GridView::widget([
                        'dataProvider' => $dataProvider,
                        'filterModel' => $searchModel,
                        'columns' => [
                            ['class' => 'yii\grid\SerialColumn'],

                            //'id',
                            //'user_id',
                            //'order_code',
                            [
                               'attribute'=>'order_code',
                               //'headerOptions' => ['style' => 'width:250px;'],
                            ],
                            [
                               'attribute'=>'total_amount',
                               //'headerOptions' => ['style' => 'width:150px;'],
                            ],
                            //'payment_status',
                            //'order_status',
                            [
                                'attribute'=>'order_status',
                                'filter' => ['New'=>'New', 'IN-PROGRESS'=>'Processing','SHIPPED'=>'Shipped','DELIVERED'=>'Delivered', 'USER CANCELLED'=>'User Canceled'],
                                //'NEW','IN-PROGRESS','SHIPPED','DELIVERED','COMPLETED','CANCELLED','FAILED-TRANSACTION','USER CANCELLED'
                                'value' => function ($model) {
                                    if($model->order_status == 'IN-PROGRESS'){