frontend/controllers/OrderController.php

                } // IF ADDRESS TEMP
            }
        }
        return $this->render('paymentCancel', [
                        //'orderId' => $orderModel->order_code,
                        //'email' => $_POST['email'],
                        //'phone' => $_POST['phone'],
                        //'addressData' => OrderAddress::find()->where(['order_id'=>$orderModel->id])->one(),
                        //'searchModel' => $searchModel,
                        //'dataProvider' => $dataProvider,
                    ]);
---
SELECT * FROM `taz_order_address` WHERE `order_id`=1