frontend/controllers/OrderController.php

SELECT * FROM `taz_order` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Order::findOne($id)) !== null) {