frontend/controllers/ProductController.php

    public function actionCreate()
    {
        $model 		= new Product();
		$imageModel = new ProductImage();
        $addressModel = new ProductAddress();

        //if ($model->load(Yii::$app->request->post()) && $model->save()) {
		if ($model->load(Yii::$app->request->post()) && $addressModel->load(Yii::$app->request->post()) && $imageModel->load(Yii::$app->request->post())) {
        //  && $imageModel->load(Yii::$app->request->post())
			/*echo '<pre>';
			print_r(Yii::$app->request->post());
			echo Yii::$app->user->id;
			exit;*/
			$postData 	= Yii::$app->request->post();
			$model->product_code 		= Common::generateRandomStr('PRD');
            $model->product_seo         = 'test-seo';
			$model->product_owner_id	= Yii::$app->user->id;
			$model->product_sale_price	= ($postData['Product']['product_price']*20)/100+$postData['Product']['product_price'];
			$model->created_on 			= Common::mysqlDateTime();
			if($model->save()){
                // add product address
                $addressModel->product_id = $model->id;
                $addressSave            = $addressModel->save();
---
INSERT INTO `taz_product` (`product_category_id`, `product_name`, `product_price`, `product_material`, `product_color`, `product_dimension_type`, `product_height`, `product_length`, `product_breadth`, `product_weight`, `product_short_description`, `product_long_description`, `product_discount_status`, `product_guarantee_status`, `product_code`, `product_seo`, `product_owner_id`, `product_sale_price`, `created_on`) VALUES (2, 'SLAPRD', '5.5', 'MS', 'COLOR', 'cm', '5.5', '5.5', '2.5', '5.5', 'SDDSDS', 'DFD', 'No', 'No', 'PRD220817193038QgOP', 'test-seo', 1, '6.6', '2017-08-22 19:30:38')
INSERT INTO `taz_product_address` (`street`, `city`, `state`, `country`, `pin_code`, `product_id`) VALUES ('Street', 'CITY', 'Tamil Nadu', 'Barbados', '635853', 3)

    protected function findModel($id)
    {
        if (($model = Product::findOne($id)) !== null) {
---
SELECT * FROM `taz_product` WHERE `id`='1'