frontend/controllers/ShopController.php

    public function actionProducts($id) {
        $this->layout = 'categoryProducts';
        $products = Shop::getProductsByCategoryId($id);
        if(!Yii::$app->user->isGuest){
            $userid = Yii::$app->user->id;
            $getUserFavoriteProducts = Yii::$app->ShopComponent->getUserFavoriteProducts($userid);
        }else{
            $getUserFavoriteProducts = [];
        }
        $userFavoriteProducts = ($getUserFavoriteProducts) ? array_column($getUserFavoriteProducts, 'product_id') : [];

        return $this->render('categoryproducts', [
                    'categoryData' => Category::findOne($id),
                    'categoryProducts' => $products,
                    'cartData' => Cart::getUserCart(),
                    'userFavoriteProducts' => $userFavoriteProducts,
        ]);
---
SELECT * FROM `taz_category` WHERE `id`='1'