frontend/controllers/SiteController.php

SELECT * FROM `taz_user` WHERE `id`=1
---
    public function actionProfileDashboard() {
        $user = User::findOne(['id' => Yii::$app->user->getId()]);

SELECT * FROM `taz_user` WHERE `id`=1
SELECT * FROM `taz_user_detail` WHERE `user_id`=1
---
    public function actionProfileUpdate() {
        $this->layout = 'profile_page';
        $usermodel = User::findOne(['id' => Yii::$app->user->getId()]);
        $UserDetail = UserDetail::findOne(['user_id' => Yii::$app->user->getId()]);
        if (!empty($UserDetail)) {
            $UserDetailModel = UserDetail::findOne(['user_id' => Yii::$app->user->getId()]);
        } else {
            $UserDetailModel = new UserDetail();
        }
        $oldImage = $usermodel->profile_image;
        $usermodel->scenario = 'update';
        if ($usermodel->load(Yii::$app->request->post()) || $UserDetailModel->load(Yii::$app->request->post())) {