frontend/controllers/UserAddressController.php

    public function actionIndex()
    {
        $this->layout       = 'profile_page';
        $userid             = Yii::$app->user->id;
        $shippingAddress    = UserAddress::findOne(['user_id'=>Yii::$app->user->id, 'address_type'=>'Shipping']);
        $billingAddress     = UserAddress::findOne(['user_id'=>Yii::$app->user->id, 'address_type'=>'Billing']);
---
SELECT * FROM `taz_user_address` WHERE (`user_id`=3) AND (`address_type`='Shipping')
SELECT * FROM `taz_user_address` WHERE (`user_id`=3) AND (`address_type`='Billing')