frontend/views/product/_form.php

/* @var $form yii\widgets\ActiveForm */


$categories			= Category::find()->where(['category_status'=>'Active'])->all();
$categoryListData	= ArrayHelper::map($categories,'id','category_name');
$countries          = Country::find()->where(['status'=>1])->all();
---
SELECT * FROM `taz_category` WHERE `category_status`='Active'
SELECT * FROM `taz_country` WHERE `status`=1