frontend/components/ShopComponent.php

    public static function getCartCount($userId){
        $cartCount 	= Cart::find()->where(['cart_user_id'=>$userId])->count();
---
SELECT COUNT(*) FROM `taz_cart` WHERE `cart_user_id`=2

    public static function getProductFavoriteCount($productId){
        $favoriteCount 	= UserFavorite::find()->where(['product_id'=>$productId])->count();
---
SELECT COUNT(*) FROM `taz_user_favorite` WHERE `product_id`=1

    public static function getUserFavoriteProducts($userId){
        return UserFavorite::find()->where(['user_id' => $userId])->asArray()->all();
---
SELECT * FROM `taz_user_favorite` WHERE `user_id`=2