common/components/Common.php

SELECT * FROM `taz_slideshow` WHERE `status`='Active' ORDER BY `order_by`
---
    public static function getBanners(){
        $banners  = Slideshow::find()->orderBy(['order_by'=>SORT_ASC])->where(['status'=>'Active'])->all();