common/models/User.php

SELECT * FROM `taz_user` WHERE (`id`=1) AND (`status`='Active')
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `taz_user` WHERE (`email`='email_rituraj@yahoo.co.in') AND (`status`='Active')
---
    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);