frontend/models/Cart.php

    public static function getCount(){
        $data = Cart::find()->where(['cart_user_id'=>Yii::$app->user->id])->count();
---
SELECT COUNT(*) FROM `taz_cart` WHERE `cart_user_id`=1

    public static function getUserCart(){
        $data = [];
        if(!Yii::$app->user->isGuest){
            $data = Cart::find()->select(['cart_product_id'])->where(['cart_user_id'=>Yii::$app->user->id])->asArray()->all();
---
SELECT `cart_product_id` FROM `taz_cart` WHERE `cart_user_id`=3