frontend/models/OrderDetailSearch.php

SELECT SUM(product_price) FROM `taz_order_detail` LEFT JOIN `taz_order` ON `taz_order_detail`.`order_id` = `taz_order`.`id` WHERE (`product_owner_id`=1) AND (taz_order.order_status<>"USER CANCELLED") AND (taz_order.order_status<>"FAILED-TRANSACTION") AND (taz_order.order_status<>"CANCELLED")
---
    public function search($params)
    {

        if(Yii::$app->user->identity->user_type == Yii::$app->params['ROLE_SELLER']){
            $query = OrderDetail::find()->joinWith('order')->where(['product_owner_id'=>Yii::$app->user->id])->andWhere('taz_order.order_status<>"USER CANCELLED"')->andWhere('taz_order.order_status<>"FAILED-TRANSACTION"')->andWhere('taz_order.order_status<>"CANCELLED"')->orderBy(['taz_order.id'=>SORT_DESC]);