frontend/models/OrderDetail.php

    public static function orderTotalAmountbyOrderId($orderId){
        $query = OrderDetail::find()->where(['order_id'=>$orderId]);
        $totalAmount = $query->sum('product_price');
---
SELECT SUM(product_price) FROM `taz_order_detail` WHERE `order_id`=3