frontend/models/Shop.php

    public static function getProductsByCategoryId($categoryId, $filters=false){
        $priceWhere = [];
        $orderBy = [];
        if($filters && isset($filters['price'])){
            $priceWhere = ['between', 'product_sale_price', ltrim($filters['price']['min'], '₹'), ltrim($filters['price']['max'], '₹')];
            //$priceWhere = ['between', 'product_sale_price', 600, 700];
        }
        // SORT
        if($filters && isset($filters['sortBy'])){
            if($filters['sortBy'] == 'newest'){
                $orderBy = ['id'=>SORT_DESC];
            }elseif ($filters['sortBy'] == 'priceLow') {
                $orderBy = ['product_sale_price'=>SORT_ASC];
            }elseif ($filters['sortBy'] == 'priceHigh') {
                $orderBy = ['product_sale_price'=>SORT_DESC];
            }
        }

		$products 	= Product::find()->where(['product_category_id'=>$categoryId, 'product_status'=>'Active'])->andWhere($priceWhere)->with('productAddresses')->with('productImages')->with('productCategory')->with('userFavorite')->with('productOwner')->orderBy($orderBy)->all();
---
SELECT * FROM `taz_user_favorite` WHERE `product_id` IN (1, 2, 3, 4)

    public static function getProductById($productId){
        $products   = Product::find()->where(['id'=>$productId, 'product_status'=>'Active'])->with('productAddresses')->with('productImages')->with('productCategory')->with('productOwner')->all();
---
SELECT * FROM `taz_category` WHERE `id`=1
SELECT * FROM `taz_product_address` WHERE `product_id`=1
SELECT * FROM `taz_product` WHERE (`id`='1') AND (`product_status`='Active')

    public static function getSimilarColorProducts($productId, $color=false){
        $products = Product::find()->where(['product_status'=>'Active'])->andWhere(['<>', 'id', $productId])->andWhere(['LIKE', 'product_color', $color])->with('productAddresses')->with('productImages')->with('productCategory')->with('userFavorite')->limit(4)->all();
---
SELECT * FROM `taz_product` WHERE (`product_status`='Active') AND (`id` <> 1) AND (`product_color` LIKE '%GREEN%') LIMIT 4
SELECT * FROM `taz_user_favorite` WHERE `product_id` IN (4, 5)

    public static function getSimilarMaterialProducts($productId, $material=false){
        $products = Product::find()->where(['product_status'=>'Active'])->andWhere(['<>', 'id', $productId])->andWhere(['LIKE', 'product_material', $material])->with('productAddresses')->with('productImages')->with('productCategory')->with('userFavorite')->limit(4)->all();
---
SELECT * FROM `taz_product` WHERE (`product_status`='Active') AND (`id` <> 1) AND (`product_material` LIKE '%WOOD%') LIMIT 4
SELECT * FROM `taz_user_favorite` WHERE `product_id` IN (2, 5, 7)

    public static function getSimilarTypeProducts($productId, $category){
        $products = Product::find()->where(['product_status'=>'Active'])->andWhere(['<>', 'id', $productId])->andWhere(['=','product_category_id', $category])->with('productImages')->limit(4)->all();
---
SELECT * FROM `taz_product_image` WHERE `product_id` IN (4, 5, 6, 9)
SELECT * FROM `taz_product` WHERE (`product_status`='Active') AND (`id` <> 1) AND (`product_category_id` = 1) LIMIT 4

    public static function getProductImageByProductId($productId){
        $productImages = ProductImage::find()->where(['product_id'=>$productId])->all();
---
SELECT * FROM `taz_product_image` WHERE `product_id`='3'

    public static function getNewAriivalProducts(){
        $products   = Product::find()->where(['product_status'=>'Active'])->with('productAddresses')->andWhere('created_on >= DATE_SUB(CURDATE(), INTERVAL 10 DAY)')->with('productImages')->with('productCategory')->limit(8)->orderBy(['created_on' => SORT_DESC])->all();
---
SELECT * FROM `taz_product` WHERE (`product_status`='Active') AND (created_on >= DATE_SUB(CURDATE(), INTERVAL 10 DAY)) ORDER BY `created_on` DESC LIMIT 8

    public static function getFeatureSellers(){
        /*$sellers = User::find()->where(['user_type'=>'Seller', 'status'=>'Active'])->andWhere('id NOT IN (SELECT seller_id FROM taz_feature_seller)')->orderBy(['created_at'=>SORT_ASC])->limit(2)->with('userDetails')->all();
        return $sellers;*/
        $featureSellers = FeatureSeller::find()->where(['status'=>'Active'])->with('sellerDetail')->all();
---
SELECT * FROM `taz_feature_seller` WHERE `status`='Active'