frontend/models/Shop.php

    public static function getProductsByCategoryId($categoryId){
		$products 	= Product::find()->where(['product_category_id'=>$categoryId, 'product_status'=>'Active'])->with('productAddresses')->with('productImages')->with('productCategory')->with('userFavorite')->all();
---
SELECT * FROM `taz_product_address` WHERE `product_id` IN (1, 4, 5, 6, 9)
SELECT * FROM `taz_product_image` WHERE `product_id` IN (1, 4, 5, 6, 9)
SELECT * FROM `taz_product` WHERE (`product_category_id`=1) AND (`product_status`='Active')
SELECT * FROM `taz_user_favorite` WHERE `product_id` IN (1, 4, 5, 6, 9)

    public static function getProductById($productId){
        $products   = Product::find()->where(['id'=>$productId, 'product_status'=>'Active'])->with('productAddresses')->with('productImages')->with('productCategory')->all();
---
SELECT * FROM `taz_category` WHERE `id`=1
SELECT * FROM `taz_product_address` WHERE `product_id`=1
SELECT * FROM `taz_product_image` WHERE `product_id`=1
SELECT * FROM `taz_product` WHERE (`id`='1') AND (`product_status`='Active')

    public static function getProductImageByProductId($productId){
        $productImages = ProductImage::find()->where(['product_id'=>$productId])->all();
---
SELECT * FROM `taz_product_image` WHERE `product_id`='10'

    public static function getNewAriivalProducts(){
        $products   = Product::find()->where(['product_status'=>'Active'])->with('productAddresses')->andWhere('created_on >= DATE_SUB(CURDATE(), INTERVAL 10 DAY)')->with('productImages')->with('productCategory')->limit(8)->orderBy(['created_on' => SORT_DESC])->all();
---
SELECT * FROM `taz_category` WHERE `id` IN (2, 1, 4)
SELECT * FROM `taz_product_address` WHERE `product_id` IN (2, 5, 7)
SELECT * FROM `taz_product_image` WHERE `product_id` IN (2, 5, 7)
SELECT * FROM `taz_product` WHERE (`product_status`='Active') AND (created_on >= DATE_SUB(CURDATE(), INTERVAL 10 DAY)) ORDER BY `created_on` DESC LIMIT 8

    public static function getFeatureSellers(){
        /*$sellers = User::find()->where(['user_type'=>'Seller', 'status'=>'Active'])->andWhere('id NOT IN (SELECT seller_id FROM taz_feature_seller)')->orderBy(['created_at'=>SORT_ASC])->limit(2)->with('userDetails')->all();
        return $sellers;*/
        $featureSellers = FeatureSeller::find()->where(['status'=>'Active'])->with('sellerDetail')->all();
---
SELECT * FROM `taz_feature_seller` WHERE `status`='Active'