frontend/widgets/WidgetFeatureSeller.php

    public function run() {
    	$feature_sellers = FeatureSeller::find()->where(['status'=>Yii::$app->params['STATUS_ACTIVE']])->all();
---
SELECT * FROM `taz_feature_seller` WHERE `status`='Active'