backend/views/product/index.php

    <p>
        <?php //echo Html::a('Add Category', ['create'], ['class' => 'btn btn-success']) ?>
    </p>
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            //'id',

            [
				'attribute'=>'product_category_id',
				'filter' => ArrayHelper::map(Category::find()->asArray()->all(), 'id', 'category_name'),
				'value' => function($model){
					return $model->productCategory->category_name;
				}
            ],
            'product_code',
            'product_name',
            [
				'attribute' => 'product_owner_id',
				'value' => function($model){
					return $model->productOwner->firstname.' '.$model->productOwner->lastname;
				}
---
SELECT * FROM `taz_product` WHERE `product_owner_id`=1 ORDER BY `id` DESC LIMIT 20
SELECT COUNT(*) FROM `taz_product` WHERE `product_owner_id`=1
SELECT * FROM `taz_category` WHERE `id`=1
SELECT * FROM `taz_category`