frontend/views/order-detail/index.php

SELECT * FROM `taz_order` WHERE `id` IN (3, 2)
---
        <div class="orderBox myOrders">
            <!--<h4>All Orders</h4>-->
            <div class="table-responsive">
                <?= GridView::widget([
                    'dataProvider' => $dataProvider,
                    'filterModel' => $searchModel,
                    //'template'=>'{items}{summary}{pager}',
                    'layout'=>"{items}{pager}",//{sorter}{pager}{summary}
                    'columns' => [
                        ['class' => 'yii\grid\SerialColumn'],


                        [
                            'attribute'=>'order_code',
                            //'value' => 'order.order_code',
                            'format'=>'raw',
                            'value'=>function($model){
                                  return Html::a($model->order->order_code, 'mysales/view/'.$model->order->id, ['style'=>'color:inherit']);
                            },
                        ],
                        //'product_name:ntext',
                        [
                           'attribute'=>'product_price',
                           //'value' => 'product_price',